{
  "architecture": {
    "backend": "tensorflow",
    "class_name": "Functional",
    "config": {
      "input_layers": [
        [
          "input_1",
          0,
          0
        ]
      ],
      "layers": [
        {
          "class_name": "InputLayer",
          "config": {
            "batch_input_shape": [
              null,
              1
            ],
            "dtype": "float32",
            "name": "input_1",
            "ragged": false,
            "sparse": false
          },
          "inbound_nodes": [],
          "name": "input_1"
        },
        {
          "class_name": "Dense",
          "config": {
            "activation": "relu",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "dtype": "float32",
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "name": "dense",
            "trainable": true,
            "units": 10,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "input_1",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "dense"
        },
        {
          "class_name": "Dense",
          "config": {
            "activation": "softmax",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "dtype": "float32",
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "name": "dense_1",
            "trainable": true,
            "units": 3,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "dense",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "dense_1"
        }
      ],
      "name": "functional_1",
      "output_layers": [
        [
          "dense_1",
          0,
          0
        ]
      ]
    },
    "keras_version": "2.4.0"
  },
  "hash": "d1c5e2b418d8e9a0f2a3bb87167414a545883c56b674f1383fc35a934eaa1d9f",
  "image_data_format": "channels_last",
  "input_shapes": [
    [
      1
    ]
  ],
  "output_shapes": [
    [
      3
    ]
  ],
  "trainable_params": {
    "dense": {
      "bias": [
        "TJ19P17n5L/s49m/Oni5v9r2qz8AAAAAAAAAAMtiCkAAAAAAAAAAAA=="
      ],
      "weights": [
        "vXuZPi5MA0Du49k/I5T3P74KhL5g/S++pZ3evnXdar69kdm+j4Yjvw=="
      ]
    },
    "dense_1": {
      "bias": [
        "Lq1DPxwoqr46n3u/"
      ],
      "weights": [
        "JywcQGgrbL8s2ay9Bjfjv9kh8z1ZPQFAD7kHwIZ74r7d9Z4/l4oYwERWt745hrQ/wsIaQFTIXb9GZC+/SLoMPsL/0b6ARvw+5HXevkywHj8QD5Y+lu08QLxdsj0r3cY+SXKhviie5j6OIBG/gHBjvLM9hr6EYw8+"
      ]
    }
  }
}
