{
  "architecture": {
    "backend": "tensorflow",
    "class_name": "Functional",
    "config": {
      "input_layers": [
        [
          "input_1",
          0,
          0
        ]
      ],
      "layers": [
        {
          "class_name": "InputLayer",
          "config": {
            "batch_input_shape": [
              null,
              4
            ],
            "dtype": "float32",
            "name": "input_1",
            "ragged": false,
            "sparse": false
          },
          "inbound_nodes": [],
          "name": "input_1"
        },
        {
          "class_name": "Dense",
          "config": {
            "activation": "relu",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "dtype": "float32",
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "name": "dense",
            "trainable": true,
            "units": 5,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "input_1",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "dense"
        },
        {
          "class_name": "Dense",
          "config": {
            "activation": "softmax",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "dtype": "float32",
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "name": "dense_1",
            "trainable": true,
            "units": 3,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "dense",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "dense_1"
        }
      ],
      "name": "functional_1",
      "output_layers": [
        [
          "dense_1",
          0,
          0
        ]
      ]
    },
    "keras_version": "2.4.0"
  },
  "hash": "e8be9d407917ddafe5e2270a07fc856b9f547c709ddbd659d962bbd753364cf4",
  "image_data_format": "channels_last",
  "input_shapes": [
    [
      4
    ]
  ],
  "output_shapes": [
    [
      3
    ]
  ],
  "tests": [
    {
      "inputs": [
        {
          "shape": [
            4
          ],
          "values": [
            "R/maP16fk7+2eqY+LCsAPw=="
          ]
        }
      ],
      "outputs": [
        {
          "shape": [
            3
          ],
          "values": [
            "FFoiPlz75D6Z18k+"
          ]
        }
      ]
    }
  ],
  "trainable_params": {
    "dense": {
      "bias": [
        "+fUDvMG51LoyrAO85FcCvAAAAAA="
      ],
      "weights": [
        "w5S2vnifpb1nUzo/SymBvkP07b6oCAm/8FPzPT3YED9qEsY+ALTCO9d2+z75Q0i/kN3lPv2SFz32li6/0sNHPyRKCz8G3T0/ADBnPlj2wD4="
      ]
    },
    "dense_1": {
      "bias": [
        "flkEPGiCBryNQAS8"
      ],
      "weights": [
        "931av2OrEj936ka+bk+cvlu7TD9kNtQ+claDvt7ccb5U6LI+BCtwPjT3UL+B+AM/+qT7PvYwO785Yxs/"
      ]
    }
  }
}
